# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'zsh'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'composer'
brew 'gibo'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'maven'
brew 'node'
brew 'rm-tree'
brew 'trash'
brew 'wget'
brew 'zsh-completions'

# Development
brew 'php56', args: ['with-debug', 'without-apache', 'with-postgresql']
brew 'php56-intl'

# Apps
cask '1password'
cask 'android-studio'
cask 'appcleaner'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'cheatsheet'
cask 'dbvisualizer'
cask 'dash'
cask 'divvy'
cask 'docker'
cask 'virtualbox-extension-pack'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'instellij-idea'
cask 'iterm2'
cask 'java'
cask 'java7'
cask 'jdownloader'
cask 'karabiner'
cask 'keka'
cask 'keybase'
cask 'macpass'
cask 'macvim'
cask 'mou'
cask 'pgadmin3'
cask 'phpstorm'
cask 'poedit'
cask 'postman'
cask 'rescuetime'
cask 'sequel-pro'
cask 'shiftit'
cask 'slack'
cask 'sts'
cask 'sublime-text'
cask 'teamviewer'
cask 'telegram'
cask 'tower'
cask 'vmware-fusion'
cask 'vlc'
cask 'webstorm'
cask 'whatsapp'
cask 'wireshark'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-open-sans'

# Install Mac App Store apps
mas 'Pixelmator', id: 407963104
mas' Microsoft Remote Desktop', id: 715768417
